{"data":{"markdownRemark":{"html":"<p>Hey <span class=\"main__body__content__span\">hacker friends!</span> Ur fam; <a href=\"mailto:me@l0rdcafe.com\">l0rdcafe</a> here. This installment is about <strong>JavaScript</strong>, or in other words my first foray into proper programming.</p>\n<p>Two weeks ago, I had little to no programming experience whatsoever. I'd read a few tutorials and seen some <strong>JavaScript</strong> syntax, enough to scare me away from programming for browsers. However, I decided it was time to face my fears and program for the web.</p>\n<p>I started off by reading and doing the <a href=\"http://asmarterwaytolearn.com/js/index-of-exercises.html\">exercises</a> for <a href=\"http://www.asmarterwaytolearn.com/\">A Smarter Way To Learn: JavaScript by Mark Myers</a>; a quick and to the point programming book that teaches you the foundations of the language whilst maintaining basic practicality. After finishing the book, I signed up and completed the <a href=\"https://watchandcode.com/p/practical-javascript\">Practical JavaScript</a> course at <a href=\"https://watchandcode.com/\">Watch and Code,</a> building a basic to-do list with the instructor. Where he goes into thorough explanation of all aspects of the program in an intuitive and practical way.</p>\n<p>Beyond the <a href=\"https://watchandcode.com/p/practical-javascript\">Watch and Code tutorial,</a> I decided to implement some extra features to the application like <strong>expired items, urgent items, item counters</strong> and other <strong>UI features.</strong> That proved to be the most educational part of the process as I encountered every programmer's best friends; <strong>bugs.</strong></p>\n<p>I quickly learned that you constantly need to maintain a <em>readable, consistent</em> and <strong>focused codebase</strong> to simplify <strong>debugging</strong>, adding features and most of all avoid mistakes. Moreover, I also learned that <strong>refactoring</strong> is necessary as a program gets bigger, and the usage of <strong>helper methods</strong> and/or <strong>functions</strong> comes into play much more prominently as an application expands.</p>\n<p>One of the more challenging undertakings of the application was <strong>date validation</strong>, but from Mark Myers' e-mail address validation explanation in <a href=\"http://www.asmarterwaytolearn.com/\">A Smarter Way To Learn: JavaScript,</a> some stubbornness, and a lot of persistence, I managed to validate the date input to the desired format and also list items as either <strong>'Urgent'</strong> or <strong>'Expired'</strong> according to their due dates.</p>\n<p>Another essential ally in my programming endeavor was a browser's <strong>debugger</strong> and <strong>console</strong>. Using the <strong>debugger</strong> to pause the program at specific points to catch <strong>bugs,</strong> going through the program line and line, stepping in and out of <strong>functions,</strong> and examining the program's behavior. As well as <strong>logging variables, calling functions</strong> and others in the <strong>console</strong> to ensure everything runs, as it ought to.</p>\n<p>Finally, and after much effort I had finished my <a href=\"#2-do\">2-Do List</a> with the features and functionality that I intended it to have. I've always disliked boasting, but I got to say that I do feel proud in this first moment of programming victory.</p>","frontmatter":{"path":"/programming-js","title":"Programming With JavaScript, Or How I Learned to Stop Worrying And Love The Debugger","date":"2017-06-01T00:00:00.000Z"}}},"pageContext":{}}