{"data":{"markdownRemark":{"html":"<p>Hey <span class=\"main__body__content__span\">hackers</span>, <span class=\"main__body__content__span\">designers</span> and <span class=\"main__body__content__span\">design hackers.</span> It's your boy <a href=\"mailto:me@l0rdcafe.com\">l0rdcafe</a>. This post is a brief overview of my experience learning graphic design basics with <a href=\"https://www.sketchapp.com/\">Sketch.</a> I'll be going through what I learned, built, and how useful these new skills are.</p>\n<p><a href=\"https://www.sketchapp.com/\">Sketch</a> is a lighter and more affordable alternative to <a href=\"http://www.adobe.com/ca/products/photoshop.html\">Adobe Photoshop.</a> <a href=\"https://www,sketchapp.com\">Sketch</a> simplifies some tasks that otherwise would be rather complicated to execute in other applications.</p>\n<p>It's also an extremely light application and moreover, allows you to copy the <strong>CSS</strong> of any <strong>asset</strong> to the clipboard and paste it to a <strong>text editor</strong>. Compared to <a href=\"http://www.adobe.com/ca/products/photoshop.html\">Photoshop</a> or other graphic design software, the <strong>CSS</strong> given by <a href=\"https://www.sketchapp.com\">Sketch</a> is incredibly clean, easily readable and concise.</p>\n<p>Secondly, I used <a href=\"https://www.lynda.com/\">Lynda</a> to complete a series of 4 <a href=\"https://www.sketchapp.com\">Sketch</a> courses. Starting off with <a href=\"https://www.lynda.com/Sketch-tutorials/Learn-Sketch-Basics/450912-2.html\">Sketch Essential Training: The Basics,</a> and designing the mockup website with the instructor using the downloadable exercise files. I quickly picked up on the basics of <a href=\"https://www.sketchapp.com\">Sketch</a> and hardly found anything too cumbersome to do.</p>\n<p>From creating <strong>artboards, to drawing vector icons, creating symbols,</strong> and finally building a responsive website for 4 devices. This course covered the essential <a href=\"https://www.sketchapp.com\">Sketch</a> basics to be able to create, edit and export <strong>assets</strong> for web development or other purposes.</p>\n<p>Afterwards, I completed the <a href=\"https://www.lynda.com/Sketch-tutorials/Learn-Sketch-Creating-Vector-Graphics/496907-2.html?srchtrk=index%3a11%0alinktypeid%3a2%0aq%3asketch%0apage%3a1%0as%3arelevance%0asa%3atrue%0aproducttypeid%3a2\">Sketch: Creating Vector Graphics</a> course, which gets more into <strong>vector graphics</strong> in terms of drawing, editing, custom borders, <strong>Bezier vectors, Boolean operations</strong> and that culminated in building an average navigation toolbar.</p>\n<p>The penultimate course named the <a href=\"https://www.lynda.com/Sketch-tutorials/Learn-Sketch-Style-Guides-Pattern-Libraries/496908-2.html\">Sketch: Style Guides &#x26; Asset Libraries</a> concerned <strong>style guides, asset libraries</strong> and how to manage and build them both efficiently as well as professionally. By the end of the course, I'd learned how to build my own <strong>asset library</strong> by combining other libraries, how to properly name <strong>assets</strong> and organize them in case of collaborative work, and finally how to share <strong>asset libraries</strong> with others.</p>\n<p>Lastly, <a href=\"https://www.lynda.com/Sketch-tutorials/UX-Design-Tools-Sketch/505807-2.html?srchtrk=index%3a1%0alinktypeid%3a2%0aq%3asketch+ux+design%0apage%3a1%0as%3arelevance%0asa%3atrue%0aproducttypeid%3a2\">Sketch for UX Design</a> was the last course I finished and it was almost an aggregate of all the aforementioned skills giving a broad outline of <a href=\"https://www.sketchapp.com\">Sketch</a> and how it can be utilized to build for a range of devices including the likes of <a href=\"https://www.apple.com/ca/watch/?afid=p238%7CsiRW00CTe-dc_mtid_2092506t42625_pcrid_187244146446_&#x26;cid=wwa-ca-kwgo-watch-slid-\">Apple Watch</a>. Also, the course gets into several <strong>plugins,</strong> <a href=\"https://www.sketchappsources.com/\">Sketch App Sources</a> and how the <a href=\"http://sketchtoolbox.com/\">Sketch Toolbox</a> can be used to install a plethora of <strong>plugins</strong> created by the vibrant <a href=\"https://www.sketchapp.com/community/\">Sketch community.</a></p>\n<p>To wrap up, <a href=\"https://www.sketchapp.com\">Sketch</a> is an impressively user-friendly tool that allows <span class=\"main__body__content__span\">designers,</span> and <span class=\"main__body__content__span\">developers</span></p>\n<p> to quickly draw up <strong>mockups</strong>, create <strong>icons,</strong> <strong>assets, asset libraries,</strong> among numerous other functions. With my newly-acquired <a href=\"https://www.sketchapp.com\">Sketch</a> nous, I made a fairly simple <a href=\"mailto:me@l0rdcafe.com\">l0rdcafe</a> logo <a href=\"#nav\">(See?)</a> as well as a mockup responsive design of a website for a fictional app for 4 devices in the <a href=\"#uber\">projects</a> section.</p>","frontmatter":{"path":"/sketch-graphic-design","title":"Hacking Graphic Design or Sketch for Devs","date":"2017-05-08T00:00:00.000Z","description":"Sketch App tutorial by l0rdcafe introducing graphic design basics for web devs outlining benefits for developers in using Sketch including easily exportable CSS as well as referencing a couple of Lynda courses teaching Sketch App basics, drawing Vector Graphics with bezier curves, creating styles guides and asset libraries and designing proper user experience.","og_description":"Basic graphic design for web developers post using Sketch App, outlining its benefits and going through my experience of learning Sketch through Lynda courses concerning topics such as bezier curves, vector graphics, style guides and UX.","twitter_description":"Graphic design for web developers using Sketch App, going through my personal experience of learning Sketch concerning topics such as bezier curves, vector graphics and style guides."}}},"pageContext":{}}